SpenceKonde/DxCore/megaavr/boards.txt
avrdx48.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx48.menu.millis.tcb0.build.millistimer=B0
avrdx48.menu.millis.tcb1.build.millistimer=B1
avrdx48.menu.millis.tcb2.build.millistimer=B2
avrdx48.menu.millis.tcb3.build.millistimer=B2
avrdx48.menu.millis.tca0.build.millistimer=A0
avrdx48.menu.millis.tca1.build.millistimer=A1
avrdx48.menu.millis.tcd0.build.millistimer=D0
avrdx48.menu.millis.disabled.build.millistimer=NONE

avrdx48.upload.tool=avrdude

avrdx48.build.board=avrdx48
avrdx48.build.core=dxcore
avrdx48.build.variant=48pin-standard
avrdx48.build.text_section_start=.text=0x0
avrdx48.build.extra_flags={build.millis} {build.adcworkaround}
avrdx48.build.export_merged_output=false
avrdx48.build.mcupostfix=

avrdx48.bootloader.tool=avrdude
avrdx48.bootloader.WDTCFG=0x00
avrdx48.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx48.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdx48.bootloader.SYSCFG1=0x03
avrdx48.bootloader.CODESIZE=0x00
avrdx48.bootloader.BOOTSIZE=0x00

avrdx48.bootloader.flashcommand=




#########################################
#
#    64 PIN AVR Dx-series
#
#########################################


avrdx64.name=64-pin AVR DA or DB




avrdx64.menu.chip.128A=AVR128DA64
avrdx64.menu.chip.128A.build.mcu=avr128da64
avrdx64.menu.chip.128A.upload.maximum_size=131072
avrdx64.menu.chip.128A.upload.maximum_data_size=16384
avrdx64.menu.chip.64A=AVR64DA64
avrdx64.menu.chip.64A.build.mcu=avr64da64
avrdx64.menu.chip.64A.upload.maximum_size=65536
avrdx64.menu.chip.64A.upload.maximum_data_size=8192
avrdx64.menu.chip.128B=AVR128DB64
avrdx64.menu.chip.128B.build.mcu=avr128db64
avrdx64.menu.chip.128B.upload.maximum_size=131072
avrdx64.menu.chip.128B.upload.maximum_data_size=16384


avrdx64.menu.clock.24=24 MHz
avrdx64.menu.clock.24.build.f_cpu=24000000L
avrdx64.menu.clock.24.build.speed=24
avrdx64.menu.clock.20=20 MHz
avrdx64.menu.clock.20.build.f_cpu=20000000L
avrdx64.menu.clock.20.build.speed=20
avrdx64.menu.clock.16=16 MHz
avrdx64.menu.clock.16.build.f_cpu=16000000L
avrdx64.menu.clock.16.build.speed=16
avrdx64.menu.clock.12=12 MHz
avrdx64.menu.clock.12.build.f_cpu=12000000L
avrdx64.menu.clock.12.build.speed=12
avrdx64.menu.clock.10=10 MHz
avrdx64.menu.clock.10.build.f_cpu=10000000L
avrdx64.menu.clock.10.build.speed=10
avrdx64.menu.clock.8=8 MHz
avrdx64.menu.clock.8.build.f_cpu=8000000L
avrdx64.menu.clock.8.build.speed=8
avrdx64.menu.clock.4=4 MHz
avrdx64.menu.clock.4.build.f_cpu=4000000L
avrdx64.menu.clock.4.build.speed=4
avrdx64.menu.clock.1=1 MHz
avrdx64.menu.clock.1.build.f_cpu=1000000L
avrdx64.menu.clock.1.build.speed=1
avrdx64.menu.clock.28=28 MHz (overclocked)
avrdx64.menu.clock.28.build.f_cpu=28000000L
avrdx64.menu.clock.28.build.speed=28
avrdx64.menu.clock.32=32 MHz (overclocked)
avrdx64.menu.clock.32.build.f_cpu=32000000L
avrdx64.menu.clock.32.build.speed=32


avrdx64.build.adcworkaround=
avrdx64.menu.adcworkaround.simple=Simple
avrdx64.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx64.menu.adcworkaround.none=Startup only

avrdx64.menu.bodvoltage.1v9=1.9V
avrdx64.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx64.menu.bodvoltage.2v45=2.45V
avrdx64.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx64.menu.bodvoltage.2v70=2.70V
avrdx64.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx64.menu.bodvoltage.2v85=2.85V
avrdx64.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx64.menu.bodmodeactive.disabled=Disabled
avrdx64.menu.bodmodeactive.enabled=Enabled
avrdx64.menu.bodmodeactive.sampled=Sampled
avrdx64.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx64.menu.bodmodesleep.disabled=Disabled
avrdx64.menu.bodmodesleep.enabled=Enabled
avrdx64.menu.bodmodesleep.sampled=Sampled
avrdx64.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx64.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx64.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx64.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx64.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx64.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx64.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdx64.menu.eesave.enable=EEPROM retained
avrdx64.menu.eesave.enable.bootloader.eesavebit=1
avrdx64.menu.eesave.disable=EEPROM not retained
avrdx64.menu.eesave.disable.bootloader.eesavebit=0

avrdx64.menu.resetpin.reset=Hardware Reset (recommended)
avrdx64.menu.resetpin.reset.bootloader.resetpinbits=10
avrdx64.menu.resetpin.input=Input (no output, ever)
avrdx64.menu.resetpin.input.bootloader.resetpinbits=00

avrdx64.menu.millis.tcb2=TCB2 (recommended)
avrdx64.menu.millis.tca0=TCA0
avrdx64.menu.millis.tca1=TCA1
avrdx64.menu.millis.tcb0=TCB0 (will break Servo)
avrdx64.menu.millis.tcb1=TCB1
avrdx64.menu.millis.tcb3=TCB3 (will break tone)
avrdx64.menu.millis.tcb4=TCB4
avrdx64.menu.millis.tcd0=TCD0
avrdx64.menu.millis.disabled=Disabled

avrdx64.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx64.menu.millis.tcb0.build.millistimer=B0
avrdx64.menu.millis.tcb1.build.millistimer=B1
avrdx64.menu.millis.tcb2.build.millistimer=B2
avrdx64.menu.millis.tcb3.build.millistimer=B3
avrdx64.menu.millis.tcb4.build.millistimer=B4
avrdx64.menu.millis.tca0.build.millistimer=A0
avrdx64.menu.millis.tca1.build.millistimer=A1
avrdx64.menu.millis.tcd0.build.millistimer=D0
avrdx64.menu.millis.disabled.build.millistimer=NONE

avrdx64.upload.tool=avrdude

avrdx64.build.board=avrdx64
avrdx64.build.core=dxcore
avrdx64.build.variant=64pin-standard
avrdx64.build.text_section_start=.text=0x0
avrdx64.build.extra_flags={build.millis} {build.adcworkaround}
avrdx64.build.export_merged_output=false
avrdx64.build.mcupostfix=

avrdx64.bootloader.tool=avrdude
avrdx64.bootloader.WDTCFG=0x00
avrdx64.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx64.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdx64.bootloader.SYSCFG1=0x03
avrdx64.bootloader.CODESIZE=0x00
avrdx64.bootloader.BOOTSIZE=0x00

avrdx64.bootloader.flashcommand=


#########################################
#
#    28 PIN AVR Dx-series
#
#########################################


avrdx28opti.name=28-pin AVR DA or DB with Optiboot




avrdx28opti.menu.chip.128A=AVR128DA28
avrdx28opti.menu.chip.128A.build.mcu=avr128da28
avrdx28opti.menu.chip.128A.upload.maximum_size=131072
avrdx28opti.menu.chip.128A.upload.maximum_data_size=16384
avrdx28opti.menu.chip.128A.bootloader.file=optiboot_dx/optiboot_dx128_ser0.hex
avrdx28opti.menu.chip.64A=AVR64DA28
avrdx28opti.menu.chip.64A.build.mcu=avr64da28
avrdx28opti.menu.chip.64A.upload.maximum_size=65536
avrdx28opti.menu.chip.64A.upload.maximum_data_size=8192
avrdx28opti.menu.chip.64A.bootloader.file=optiboot_dx/optiboot_dx_ser0.hex
avrdx28opti.menu.chip.32A=AVR32DA28
avrdx28opti.menu.chip.32A.build.mcu=avr32da28
avrdx28opti.menu.chip.32A.upload.maximum_size=32768
avrdx28opti.menu.chip.32A.upload.maximum_data_size=4096
avrdx28opti.menu.chip.64A.bootloader.file=optiboot_dx/optiboot_dx_ser0.hex
avrdx28opti.menu.chip.128B=AVR128DB28
avrdx28opti.menu.chip.128B.build.mcu=avr128db28
avrdx28opti.menu.chip.128B.upload.maximum_size=131072
avrdx28opti.menu.chip.128B.upload.maximum_data_size=16384
avrdx28opti.menu.chip.128B.bootloader.file=optiboot_dx/optiboot_dx128_ser0.hex


avrdx28opti.menu.clock.24=24 MHz
avrdx28opti.menu.clock.24.build.f_cpu=24000000L
avrdx28opti.menu.clock.24.build.speed=24
avrdx28opti.menu.clock.20=20 MHz
avrdx28opti.menu.clock.20.build.f_cpu=20000000L
avrdx28opti.menu.clock.20.build.speed=20
avrdx28opti.menu.clock.16=16 MHz
avrdx28opti.menu.clock.16.build.f_cpu=16000000L
avrdx28opti.menu.clock.16.build.speed=16
avrdx28opti.menu.clock.12=12 MHz
avrdx28opti.menu.clock.12.build.f_cpu=12000000L
avrdx28opti.menu.clock.12.build.speed=12
avrdx28opti.menu.clock.10=10 MHz
avrdx28opti.menu.clock.10.build.f_cpu=10000000L
avrdx28opti.menu.clock.10.build.speed=10
avrdx28opti.menu.clock.8=8 MHz
avrdx28opti.menu.clock.8.build.f_cpu=8000000L
avrdx28opti.menu.clock.8.build.speed=8
avrdx28opti.menu.clock.4=4 MHz
avrdx28opti.menu.clock.4.build.f_cpu=4000000L
avrdx28opti.menu.clock.4.build.speed=4
avrdx28opti.menu.clock.1=1 MHz
avrdx28opti.menu.clock.1.build.f_cpu=1000000L
avrdx28opti.menu.clock.1.build.speed=1
avrdx28opti.menu.clock.28=28 MHz (overclocked)
avrdx28opti.menu.clock.28.build.f_cpu=28000000L
avrdx28opti.menu.clock.28.build.speed=28
avrdx28opti.menu.clock.32=32 MHz (overclocked)
avrdx28opti.menu.clock.32.build.f_cpu=32000000L
avrdx28opti.menu.clock.32.build.speed=32

