SpenceKonde/DxCore/megaavr/boards.txt
avrdx28opti.build.adcworkaround=
avrdx28opti.menu.adcworkaround.simple=Enabled
avrdx28opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx28opti.menu.adcworkaround.none=Disabled


avrdx28opti.menu.bodvoltage.1v9=1.9V
avrdx28opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx28opti.menu.bodvoltage.2v45=2.45V
avrdx28opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx28opti.menu.bodvoltage.2v70=2.70V
avrdx28opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx28opti.menu.bodvoltage.2v85=2.85V
avrdx28opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx28opti.menu.bodmodeactive.disabled=Disabled
avrdx28opti.menu.bodmodeactive.enabled=Enabled
avrdx28opti.menu.bodmodeactive.sampled=Sampled
avrdx28opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx28opti.menu.bodmodesleep.disabled=Disabled
avrdx28opti.menu.bodmodesleep.enabled=Enabled
avrdx28opti.menu.bodmodesleep.sampled=Sampled
avrdx28opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx28opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx28opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx28opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx28opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx28opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx28opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdx28opti.menu.millis.tcb2=TCB2 (recommended)
avrdx28opti.menu.millis.tca0=TCA0
avrdx28opti.menu.millis.tcb2=TCB0 (will break Servo)
avrdx28opti.menu.millis.tcb2=TCB1 (will break tone)
avrdx28opti.menu.millis.tcd0=TCD0
avrdx28opti.menu.millis.disabled=Disabled

avrdx28opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx28opti.menu.millis.tcb0.build.millistimer=B0
avrdx28opti.menu.millis.tcb1.build.millistimer=B1
avrdx28opti.menu.millis.tcb2.build.millistimer=B2
avrdx28opti.menu.millis.tca0.build.millistimer=A0
avrdx28opti.menu.millis.tcd0.build.millistimer=D0
avrdx28opti.menu.millis.disabled.build.millistimer=NONE

avrdx28opti.upload.tool=avrdude

avrdx28opti.build.board=avrdx28
avrdx28opti.build.core=dxcore
avrdx28opti.build.variant=28pin-standard
avrdx28opti.build.extra_flags={build.millis} {build.adcworkaround}
avrdx28opti.build.export_merged_output=true

avrdx28opti.bootloader.tool=avrdude
avrdx28opti.bootloader.WDTCFG=0x00
avrdx28opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx28opti.bootloader.SYSCFG0=0xC8
avrdx28opti.bootloader.SYSCFG1=0x03
avrdx28opti.bootloader.CODESIZE=0x00
avrdx28opti.bootloader.BOOTSIZE=0x02

avrdx28opti.upload.protocol=arduino
avrdx28opti.upload.extra_params=-D
avrdx28opti.upload.speed=115200
avrdx28opti.build.text_section_start=.text=0x400
avrdx28opti.build.mcupostfix=opti
avrdx28opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
avrdx28opti.bootloader.tool=avrdude


#########################################
#
#    32 PIN AVR Dx-series Optiboot
#
#########################################


avrdx32opti.name=32-pin AVR DA or DB with Optiboot

avrdx32opti.menu.chip.128A=AVR128DA32
avrdx32opti.menu.chip.128A.build.mcu=avr128da32
avrdx32opti.menu.chip.128A.upload.maximum_size=131072
avrdx32opti.menu.chip.128A.upload.maximum_data_size=16384
avrdx32opti.menu.chip.128A.bootloader.file=optiboot_dx/optiboot_dx128_ser0.hex
avrdx32opti.menu.chip.64A=AVR64DA32
avrdx32opti.menu.chip.64A.build.mcu=avr64da32
avrdx32opti.menu.chip.64A.upload.maximum_size=65536
avrdx32opti.menu.chip.64A.upload.maximum_data_size=8192
avrdx32opti.menu.chip.64A.bootloader.file=optiboot_dx/optiboot_dx_ser0.hex
avrdx32opti.menu.chip.32A=AVR32DA32
avrdx32opti.menu.chip.32A.build.mcu=avr32da32
avrdx32opti.menu.chip.32A.upload.maximum_size=32768
avrdx32opti.menu.chip.32A.upload.maximum_data_size=4096
avrdx32opti.menu.chip.32A.bootloader.file=optiboot_dx/optiboot_dx_ser0.hex
avrdx32opti.menu.chip.128B=AVR128DB32
avrdx32opti.menu.chip.128B.build.mcu=avr128db32
avrdx32opti.menu.chip.128B.upload.maximum_size=131072
avrdx32opti.menu.chip.128B.upload.maximum_data_size=16384
avrdx32opti.menu.chip.128B.bootloader.file=optiboot_dx/optiboot_dx128_ser0.hex


avrdx32opti.menu.clock.24=24 MHz
avrdx32opti.menu.clock.24.build.f_cpu=24000000L
avrdx32opti.menu.clock.24.build.speed=24
avrdx32opti.menu.clock.20=20 MHz
avrdx32opti.menu.clock.20.build.f_cpu=20000000L
avrdx32opti.menu.clock.20.build.speed=20
avrdx32opti.menu.clock.16=16 MHz
avrdx32opti.menu.clock.16.build.f_cpu=16000000L
avrdx32opti.menu.clock.16.build.speed=16
avrdx32opti.menu.clock.12=12 MHz
avrdx32opti.menu.clock.12.build.f_cpu=12000000L
avrdx32opti.menu.clock.12.build.speed=12
avrdx32opti.menu.clock.10=10 MHz
avrdx32opti.menu.clock.10.build.f_cpu=10000000L
avrdx32opti.menu.clock.10.build.speed=10
avrdx32opti.menu.clock.8=8 MHz
avrdx32opti.menu.clock.8.build.f_cpu=8000000L
avrdx32opti.menu.clock.8.build.speed=8
avrdx32opti.menu.clock.4=4 MHz
avrdx32opti.menu.clock.4.build.f_cpu=4000000L
avrdx32opti.menu.clock.4.build.speed=4
avrdx32opti.menu.clock.1=1 MHz
avrdx32opti.menu.clock.1.build.f_cpu=1000000L
avrdx32opti.menu.clock.1.build.speed=1
avrdx32opti.menu.clock.28=28 MHz (overclocked)
avrdx32opti.menu.clock.28.build.f_cpu=28000000L
avrdx32opti.menu.clock.28.build.speed=28
avrdx32opti.menu.clock.32=32 MHz (overclocked)
avrdx32opti.menu.clock.32.build.f_cpu=32000000L
avrdx32opti.menu.clock.32.build.speed=32

avrdx32opti.build.adcworkaround=
avrdx32opti.menu.adcworkaround.simple=Simple
avrdx32opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx32opti.menu.adcworkaround.none=Startup only



avrdx32opti.menu.bodvoltage.1v9=1.9V
avrdx32opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx32opti.menu.bodvoltage.2v45=2.45V
avrdx32opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx32opti.menu.bodvoltage.2v70=2.70V
avrdx32opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx32opti.menu.bodvoltage.2v85=2.85V
avrdx32opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx32opti.menu.bodmodeactive.disabled=Disabled
avrdx32opti.menu.bodmodeactive.enabled=Enabled
avrdx32opti.menu.bodmodeactive.sampled=Sampled
avrdx32opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx32opti.menu.bodmodesleep.disabled=Disabled
avrdx32opti.menu.bodmodesleep.enabled=Enabled
avrdx32opti.menu.bodmodesleep.sampled=Sampled
avrdx32opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx32opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx32opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx32opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx32opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx32opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx32opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdx32opti.menu.millis.tcb2=TCB2 (recommended)
avrdx32opti.menu.millis.tca0=TCA0
avrdx32opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdx32opti.menu.millis.tcb2=TCB1
avrdx32opti.menu.millis.tcd0=TCD0
avrdx32opti.menu.millis.disabled=Disabled

