SpenceKonde/DxCore/megaavr/boards.txt
avrdx32opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx32opti.menu.millis.tcb0.build.millistimer=B0
avrdx32opti.menu.millis.tcb1.build.millistimer=B1
avrdx32opti.menu.millis.tcb2.build.millistimer=B2
avrdx32opti.menu.millis.tca0.build.millistimer=A0
avrdx32opti.menu.millis.tcd0.build.millistimer=D0
avrdx32opti.menu.millis.disabled.build.millistimer=NONE

avrdx32opti.upload.tool=avrdude

avrdx32opti.build.board=avrdx32
avrdx32opti.build.core=dxcore
avrdx32opti.build.variant=32pin-standard
avrdx32opti.build.extra_flags={build.millis} {build.adcworkaround}

avrdx32opti.bootloader.tool=avrdude
avrdx32opti.bootloader.WDTCFG=0x00
avrdx32opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx32opti.bootloader.SYSCFG0=0xC8
avrdx32opti.bootloader.SYSCFG1=0x03
avrdx32opti.bootloader.CODESIZE=0x00
avrdx32opti.bootloader.BOOTSIZE=0x02

avrdx32opti.upload.protocol=arduino
avrdx32opti.upload.extra_params=-D
avrdx32opti.upload.speed=115200
avrdx32opti.build.text_section_start=.text=0x400
avrdx32opti.build.mcupostfix=opti
avrdx32opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
avrdx32opti.bootloader.tool=avrdude


#########################################
#
#    48 PIN AVR DA-series
#
#########################################



avrdx48opti.name=48-pin AVR DA or DB with Optiboot

avrdx48opti.menu.chip.128A=AVR128DA48
avrdx48opti.menu.chip.128A.build.mcu=avr128da48
avrdx48opti.menu.chip.128A.upload.maximum_size=131072
avrdx48opti.menu.chip.128A.upload.maximum_data_size=16384
avrdx48opti.menu.chip.128A.bootloader.file=optiboot_dx/optiboot_dx128_ser0.hex
avrdx48opti.menu.chip.64A=AVR64DA48
avrdx48opti.menu.chip.64A.build.mcu=avr64da48
avrdx48opti.menu.chip.64A.upload.maximum_size=65536
avrdx48opti.menu.chip.64A.upload.maximum_data_size=8192
avrdx48opti.menu.chip.64A.bootloader.file=optiboot_dx/optiboot_dx_ser0.hex
avrdx48opti.menu.chip.32A=AVR32DA48
avrdx48opti.menu.chip.32A.build.mcu=avr32da48
avrdx48opti.menu.chip.32A.upload.maximum_size=32768
avrdx48opti.menu.chip.32A.upload.maximum_data_size=4096
avrdx48opti.menu.chip.32A.bootloader.file=optiboot_dx/optiboot_dx_ser0.hex
avrdx48opti.menu.chip.128B=AVR128DB48
avrdx48opti.menu.chip.128B.build.mcu=avr128db48
avrdx48opti.menu.chip.128B.upload.maximum_size=131072
avrdx48opti.menu.chip.128B.upload.maximum_data_size=16384
avrdx48opti.menu.chip.128B.bootloader.file=optiboot_dx/optiboot_dx128_ser0.hex


avrdx48opti.menu.clock.24=24 MHz
avrdx48opti.menu.clock.24.build.f_cpu=24000000L
avrdx48opti.menu.clock.24.build.speed=24
avrdx48opti.menu.clock.20=20 MHz
avrdx48opti.menu.clock.20.build.f_cpu=20000000L
avrdx48opti.menu.clock.20.build.speed=20
avrdx48opti.menu.clock.16=16 MHz
avrdx48opti.menu.clock.16.build.f_cpu=16000000L
avrdx48opti.menu.clock.16.build.speed=16
avrdx48opti.menu.clock.12=12 MHz
avrdx48opti.menu.clock.12.build.f_cpu=12000000L
avrdx48opti.menu.clock.12.build.speed=12
avrdx48opti.menu.clock.10=10 MHz
avrdx48opti.menu.clock.10.build.f_cpu=10000000L
avrdx48opti.menu.clock.10.build.speed=10
avrdx48opti.menu.clock.8=8 MHz
avrdx48opti.menu.clock.8.build.f_cpu=8000000L
avrdx48opti.menu.clock.8.build.speed=8
avrdx48opti.menu.clock.4=4 MHz
avrdx48opti.menu.clock.4.build.f_cpu=4000000L
avrdx48opti.menu.clock.4.build.speed=4
avrdx48opti.menu.clock.1=1 MHz
avrdx48opti.menu.clock.1.build.f_cpu=1000000L
avrdx48opti.menu.clock.1.build.speed=1
avrdx48opti.menu.clock.28=28 MHz (overclocked)
avrdx48opti.menu.clock.28.build.f_cpu=28000000L
avrdx48opti.menu.clock.28.build.speed=28
avrdx48opti.menu.clock.32=32 MHz (overclocked)
avrdx48opti.menu.clock.32.build.f_cpu=32000000L
avrdx48opti.menu.clock.32.build.speed=32


avrdx48opti.build.adcworkaround=
avrdx48opti.menu.adcworkaround.simple=Simple
avrdx48opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx48opti.menu.adcworkaround.none=Startup only

avrdx48opti.menu.bodvoltage.1v9=1.9V
avrdx48opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx48opti.menu.bodvoltage.2v45=2.45V
avrdx48opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx48opti.menu.bodvoltage.2v70=2.70V
avrdx48opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx48opti.menu.bodvoltage.2v85=2.85V
avrdx48opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx48opti.menu.bodmodeactive.disabled=Disabled
avrdx48opti.menu.bodmodeactive.enabled=Enabled
avrdx48opti.menu.bodmodeactive.sampled=Sampled
avrdx48opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx48opti.menu.bodmodesleep.disabled=Disabled
avrdx48opti.menu.bodmodesleep.enabled=Enabled
avrdx48opti.menu.bodmodesleep.sampled=Sampled
avrdx48opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx48opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx48opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx48opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx48opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx48opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx48opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

avrdx48opti.menu.millis.tcb2=TCB2 (recommended)
avrdx48opti.menu.millis.tca0=TCA0
avrdx48opti.menu.millis.tca1=TCA1
avrdx48opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdx48opti.menu.millis.tcb1=TCB1
avrdx48opti.menu.millis.tcb3=TCB3 (will break tone)
avrdx48opti.menu.millis.tcd0=TCD0
avrdx48opti.menu.millis.disabled=Disabled

avrdx48opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx48opti.menu.millis.tcb0.build.millistimer=B0
avrdx48opti.menu.millis.tcb1.build.millistimer=B1
avrdx48opti.menu.millis.tcb2.build.millistimer=B2
avrdx48opti.menu.millis.tcb3.build.millistimer=B2
avrdx48opti.menu.millis.tca0.build.millistimer=A0
avrdx48opti.menu.millis.tca1.build.millistimer=A1
avrdx48opti.menu.millis.tcd0.build.millistimer=D0
avrdx48opti.menu.millis.disabled.build.millistimer=NONE

avrdx48opti.upload.tool=avrdude

avrdx48opti.build.board=avrdx48
avrdx48opti.build.core=dxcore
avrdx48opti.build.variant=48pin-standard
avrdx48opti.build.extra_flags={build.millis} {build.adcworkaround}
avrdx48opti.build.export_merged_output=true

avrdx48opti.bootloader.tool=avrdude
avrdx48opti.bootloader.WDTCFG=0x00
avrdx48opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdx48opti.bootloader.SYSCFG0=0xC8
avrdx48opti.bootloader.SYSCFG1=0x03
avrdx48opti.bootloader.CODESIZE=0x00
avrdx48opti.bootloader.BOOTSIZE=0x02

avrdx48opti.upload.protocol=arduino
avrdx48opti.upload.extra_params=-D
avrdx48opti.upload.speed=115200
avrdx48opti.build.text_section_start=.text=0x400
avrdx48opti.build.mcupostfix=opti
avrdx48opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
avrdx48opti.bootloader.tool=avrdude

#########################################
#
#    64 PIN AVR Dx-series
#
#########################################


avrdx64opti.name=64-pin AVR DA or DB with Optiboot


avrdx64opti.menu.chip.128A=AVR128DA64
avrdx64opti.menu.chip.128A.build.mcu=avr128da64
avrdx64opti.menu.chip.128A.upload.maximum_size=131072
avrdx64opti.menu.chip.128A.upload.maximum_data_size=16384
avrdx64opti.menu.chip.128A.bootloader.file=optiboot_dx/optiboot_dx128_ser0.hex
avrdx64opti.menu.chip.64A=AVR64DA64
avrdx64opti.menu.chip.64A.build.mcu=avr64da64
avrdx64opti.menu.chip.64A.upload.maximum_size=65536
avrdx64opti.menu.chip.64A.upload.maximum_data_size=8192
avrdx64opti.menu.chip.64A.bootloader.file=optiboot_dx/optiboot_dx_ser0.hex
avrdx64opti.menu.chip.128B=AVR128DB64
avrdx64opti.menu.chip.128B.build.mcu=avr128db64
avrdx64opti.menu.chip.128B.upload.maximum_size=131072
avrdx64opti.menu.chip.128B.upload.maximum_data_size=16384
avrdx64opti.menu.chip.128B.bootloader.file=optiboot_dx/optiboot_dx128_ser0.hex


avrdx64opti.menu.clock.24=24 MHz
avrdx64opti.menu.clock.24.build.f_cpu=24000000L
avrdx64opti.menu.clock.24.build.speed=24
avrdx64opti.menu.clock.20=20 MHz
avrdx64opti.menu.clock.20.build.f_cpu=20000000L
avrdx64opti.menu.clock.20.build.speed=20
avrdx64opti.menu.clock.16=16 MHz
avrdx64opti.menu.clock.16.build.f_cpu=16000000L
avrdx64opti.menu.clock.16.build.speed=16
avrdx64opti.menu.clock.12=12 MHz
avrdx64opti.menu.clock.12.build.f_cpu=12000000L
avrdx64opti.menu.clock.12.build.speed=12
avrdx64opti.menu.clock.10=10 MHz
avrdx64opti.menu.clock.10.build.f_cpu=10000000L
avrdx64opti.menu.clock.10.build.speed=10
avrdx64opti.menu.clock.8=8 MHz
avrdx64opti.menu.clock.8.build.f_cpu=8000000L
avrdx64opti.menu.clock.8.build.speed=8
avrdx64opti.menu.clock.4=4 MHz
avrdx64opti.menu.clock.4.build.f_cpu=4000000L
avrdx64opti.menu.clock.4.build.speed=4
avrdx64opti.menu.clock.1=1 MHz
avrdx64opti.menu.clock.1.build.f_cpu=1000000L
avrdx64opti.menu.clock.1.build.speed=1
avrdx64opti.menu.clock.28=28 MHz (overclocked)
avrdx64opti.menu.clock.28.build.f_cpu=28000000L
avrdx64opti.menu.clock.28.build.speed=28
avrdx64opti.menu.clock.32=32 MHz (overclocked)
avrdx64opti.menu.clock.32.build.f_cpu=32000000L
avrdx64opti.menu.clock.32.build.speed=32


avrdx64opti.build.adcworkaround=
avrdx64opti.menu.adcworkaround.simple=Simple
avrdx64opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrdx64opti.menu.adcworkaround.none=Startup only

avrdx64opti.menu.bodvoltage.1v9=1.9V
avrdx64opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdx64opti.menu.bodvoltage.2v45=2.45V
avrdx64opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdx64opti.menu.bodvoltage.2v70=2.70V
avrdx64opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdx64opti.menu.bodvoltage.2v85=2.85V
avrdx64opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdx64opti.menu.bodmodeactive.disabled=Disabled
avrdx64opti.menu.bodmodeactive.enabled=Enabled
avrdx64opti.menu.bodmodeactive.sampled=Sampled
avrdx64opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdx64opti.menu.bodmodesleep.disabled=Disabled
avrdx64opti.menu.bodmodesleep.enabled=Enabled
avrdx64opti.menu.bodmodesleep.sampled=Sampled
avrdx64opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdx64opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdx64opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdx64opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdx64opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdx64opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdx64opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10



avrdx64opti.menu.millis.tcb2=TCB2 (recommended)
avrdx64opti.menu.millis.tca0=TCA0
avrdx64opti.menu.millis.tca1=TCA1
avrdx64opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdx64opti.menu.millis.tcb1=TCB1
avrdx64opti.menu.millis.tcb3=TCB3 (will break tone)
avrdx64opti.menu.millis.tcb4=TCB4
avrdx64opti.menu.millis.tcd0=TCD0
avrdx64opti.menu.millis.disabled=Disabled

avrdx64opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdx64opti.menu.millis.tcb0.build.millistimer=B0
avrdx64opti.menu.millis.tcb1.build.millistimer=B1
avrdx64opti.menu.millis.tcb2.build.millistimer=B2
avrdx64opti.menu.millis.tcb3.build.millistimer=B3
avrdx64opti.menu.millis.tcb4.build.millistimer=B4
avrdx64opti.menu.millis.tca0.build.millistimer=A0
avrdx64opti.menu.millis.tca1.build.millistimer=A1
avrdx64opti.menu.millis.tcd0.build.millistimer=D0
avrdx64opti.menu.millis.disabled.build.millistimer=NONE

